Repository: nmset/U7
Catalog: Resources/Lokalize/*/utf8util.po
Languages: fr

source: Unhandled base:
fr: Base non pris en charge:

source: This operational mode removes character markings, control characters, default ignorable characters and unassigned codepoints from an UTF-8 input.The utf8proc library, on which this utility is based, refers to character markings as 'non-spacing, spacing and enclosing (accents)' marks, and to default ignorable characters 'such as SOFT-HYPHEN or ZERO-WIDTH-SPACE'. Control characters are stripped or converted to spaces. By default, every removable byte is stripped, the output characters are decomposed and Unicode Versioning Stability is enforced. -i, --ignore: do not strip 'default ignorable characters' -c, --control: do not handle 'control characters' -m, --mark: do not strip 'character markings' -n, --na: do not strip 'unassigned codepoints' -r, --recompose: output recomposed characters -h, --help: show this message The input can be piped in or read from stdin. It must be a single NULL terminated line.
fr: Ce mode opératoire supprime les marques de caractère, les caractères de contrôle, les caractères pouvant être ignorés et les points de code non-assignés d'une entrée en UTF-8. La bibliothèque utf8proc, à la base de cet utilitaire, décrit les marques de caractères comme 'non-espaçant, espaçant et encadrant (accents) ', et les caractères pouvant être ignorés 'tels que SOFT-HYPHEN ou ZERO-SPACE-WIDTH'. Les caractères de contrôle sont supprimés ou convertis en espaces. Par défaut, chaque octet pouvant être supprimé est supprimé, les caractères en sortie sont décomposés et la 'Unicode Versioning Stability' est appliquée. -i, --ignore: ne pas supprimer les 'caractères pouvant être ignorés' -c, --control: ignorer les 'caractères de contrôle' -m, --mark: ne pas supprimer les 'marques de caractères' -n, --na: ne pas supprimer les 'points de code non-assignés' -r, --recompose: recomposer les caractères en sortie -h, --help: afficher ce message L'entrée peut être effectué via in tuyau (pipe) ou via l'entrée standard (stdin). Elle doit être une ligne unique, terminée par un caractère NULL.

source: This operational mode normalizes the input string according to the specified type, the default being NFC. -t, --type: one of NFC, NFD, NFKC, NFKD, NFKC_Casefold -h, --help: show this message The input can be piped in or read from stdin. It must be a single NULL terminated line.
fr: Ce mode opératoire normalise l'entrée selon le type spécifié, NFC par défaut. -t, --type: peut être NFC, NFD, NFKC, NFKD, NFKC_Casefold -h, --help: afficher ce message L'entrée peut être effectué via in tuyau (pipe) ou via l'entrée standard (stdin). Elle doit être une ligne unique, terminée par un caractère NULL.

source: This operational mode displays representations of the first identified codepoint. -p, --codepoint: hexadecimal representation of the codepoint -e, --utf8: hexadecimal representation of each byte -s, --utf16: hexadecimal representation of each surrogate -b, --binary: binary representation of each byte -o, --octal: octal representation of each byte -d, --decimal: decimal representation of each byte -x, --xml: XML decimal representation of each byte -L, --tolower: displays the codepoint as a lower-case character if existent -U, --toupper: displays the codepoint as an upper-case character if existent -T, --totitle: displays the codepoint as a title-case character if existent -h, --help: show this message The input can be piped in or read from stdin. Pass in a single character for simplicity.
fr: Ce mode opératoire affiche des représentations du premier point de code identifié. -p, --codepoint: représentation hexadécimale du point de code -e, --utf8: représentation hexadécimale de chaque octet -s, --utf16: représentation hexadécimale de chaque codet (surrogate) -b, --binary: représentation binaire de chaque octet -o, --octal: représentation octale de chaque octet -d, --decimal: représentation décimale de chaque octet -x, --xml: entité décimale XML de chaque octet -L, --tolower: affiche le point de code en casse minuscule si le caractère existe -U, --toupper: affiche le point de code en casse majuscule si le caractère existe -T, --totitle: affiche le point de code en casse de titre si le caractère existe -h, --help: afficher ce message L'entrée peut être effectué via in tuyau (pipe) ou via l'entrée standard (stdin). Passez un caractère unique par souci de simplicité.

source: This operational mode displays properties of the first identified codepoint. -l, --islower: displays 1 if the codepoint refers to a lower-case character, 0 otherwise -u, --isupper: displays 1 if the codepoint refers to an upper-case character, 0 otherwise -c, --category: determines the category of a codepoint (Letter, Number, Symbol...) -n, --direction: determines the bidirectional class of a codepoint; see utf8proc.h -i, --decompositiontype: determines the decomposition type of a codepoint; see utf8proc.h -k, --boundclass: determines the boundclass property of a codepoint; see utf8proc.h -h, --help: show this message The input can be piped in or read from stdin. Pass in a single character for simplicity.
fr: Ce mode opératoire affiche des propriétés du premier point de code identifié. -l, --islower: affiche 1 si le point de code se réfère à la casse minuscule d'un caractère, sinon 0 -u, --isupper: affiche 1 si le point de code se réfère à la casse majuscule d'un caractère, sinon 0 -c, --category: détermine la catégorie d'un point de code (Lettre, Nombre, Symbole...) -n, --direction: détermine la bidirection d'un point de code; voir utf8proc.h -i, --decompositiontype: détermine le type de décomposition d'un point de code; voir utf8proc.h -k, --boundclass: détermine la propriété 'boundclass' d'un point de code; voir utf8proc.h -h, --help: afficher ce message L'entrée peut être effectué via in tuyau (pipe) ou via l'entrée standard (stdin). Passez un caractère unique par souci de simplicité.

source: Unknown type; valid types are NFC, NFD, NFKC, NFKD and NFKC_Casefold.
fr: Type inconnu; les types connus sont NFC, NFD, NFKC, NFKD et NFKC_Casefold.

source: No valid bytes at start of input.
fr: Pas d'octet valide au début de l'entrée.

source: Codepoint:
fr: Point de code:

source: Binary:
fr: Binaire:

source: Decimal:
fr: Décimal:

source: XML decimal:
fr: XML décimal:

source: To lower:
fr: En minuscule:

source: To upper:
fr: En majuscule:

source: To title:
fr: En titre:

source: Character:
fr: Caractère:

source: Is lower:
fr: Est minuscule:

source: Is upper:
fr: Est majuscule:

source: Category: [
fr: Catégorie: [

source: Decomposition type:
fr: Type de décomposition:

source: Bound class:
fr: Classe 'bound':

source: Other, not assigned
fr: Autre, non assigné

source: Letter, uppercase
fr: Lettre, majuscule

source: Letter, lowercase
fr: Lettre, minuscule

source: Letter, titlecase
fr: Lettre, titre

source: Letter, modifier
fr: Lettre, modificateur

source: Letter, other
fr: Lettre, autre

source: Mark, nonspacing
fr: Marque, non-espaçant

source: Mark, spacing combining
fr: Marque, espaçant et combinant

source: Mark, enclosing
fr: Marque, encadrant

source: Number, letter
fr: Nombre, lettre

source: Number, other
fr: Nombre, autre

source: Punctuation, connector
fr: Ponctuation, connecteur

source: Punctuation, dash
fr: Ponctuation, tiret

source: Punctuation, open
fr: Ponctuation, ouverture

source: Punctuation, close
fr: Ponctuation, fermeture

source: Punctuation, initial quote
fr: Ponctuation, guillemet initial

source: Punctuation, final quote
fr: Ponctuation, guillemet final

source: Punctuation, other
fr: Ponctuation, autre

source: Symbol, math
fr: Symbole, math

source: Symbol, currency
fr: Symbole, monnaie

source: Symbol, modifier
fr: Symbole, modificateur

source: Symbol, other
fr: Symbole, autre

source: Separator, space
fr: Séparateur, espace

source: Separator, line
fr: Séparateur, ligne

source: Separator, paragraph
fr: Séparateur, paragraphe

source: Other, control
fr: Autre, contrôle

source: Other, format
fr: Autre, format

source: Other, surrogate
fr: Autre, codet

source: Other, private use
fr: Autre, usage privé

source: Left-to-Right
fr: Gauche-Droit

source: Left-to-Right Embedding
fr: Gauche-Droit incorporé

source: Left-to-Right Override
fr: Gauche-Droit outrepassé

source: Right-to-Left
fr: Droit-Gauche

source: Right-to-Left Arabic
fr: Droit-Gauche Arabe

source: Right-to-Left Embedding
fr: Droit-Gauche incorporé

source: Right-to-Left Override
fr: Droit-Gauche outrepassé

source: European Number
fr: Nombre Européen

source: European Separator
fr: Séparateur Européen

source: European Number Terminator
fr: Terminaison de Nombre Européen

source: Arabic Number
fr: Nombre Arabe

source: Common Number Separator
fr: Séparateur de Nombre Commun

source: Nonspacing Mark
fr: Marque Non-Espaçant

source: Boundary Neutral
fr: Périmètre Neutre

source: Paragraph Separator
fr: Séparateur de Paragraphe

source: Segment Separator
fr: Séparateur de Segment

source: Whitespace
fr: Espace

source: Other Neutrals
fr: Neutre : Autres

source: Left-to-Right Isolate
fr: Gauche-Droit Isoler

source: Right-to-Left Isolate
fr: Droit-Gauche Isoler

source: First Strong Isolate
fr: Premier Fortement Isolé

source: Unknown
fr: Inconnu

source: Font
fr: Police

source: Nobreak
fr: Non-cassant

source: Medial
fr: Médial

source: Isolated
fr: Isolé

source: Circle
fr: Cercle

source: Wide
fr: Large

source: Narrow
fr: Étroit

source: Small
fr: Petit

source: Square
fr: Carré

source: Start
fr: Début

source: Other
fr: Autre

source: Control
fr: Contrôler

source: Extend
fr: Étendre

source: Regional indicator
fr: Indicateur Régional

source: Spacingmark
fr: Marque d'espacement

source: Prepend
fr: Préfixer

source: Zero Width Joiner
fr: Accoler

source: Emoji Base
fr: Base Emoji

source: Emoji Modifier
fr: Modificateur Emoji

source: A mode of operation is required: unaccent, normalize, representation, properties, about. Pass '--help' for more information in each mode.
fr: Un mode opératoire est requis: unaccent, normalize, representation, properties, about. Utilisez '--help' pour plus d'information à propos de chaque mode.
